app/controllers/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @search = Item.search do

SELECT "items".* FROM "items"
---
  def results
    @rsize = params[:rsize]
    if @rsize.blank?
       @rsize = "2"
    end
    @sterm = params[:search]
    @search = Item.search do

INSERT INTO "items" ("brand", "category", "created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save